list_support = [
    'Так держать! 👍',
    'Ты молодец! 👏',
    'У тебя все получится, я верю в тебя! 💪',
    'Продолжай в том же духе! 💯',
    'Ты делаешь все правильно, не сомневайся! 🌟',
    'Ты на верном пути к успеху! 💫',
    'Ты очень талантливый/талантливая! 🤩',
    'Твой труд принесет свои плоды! 🍎',
    'Ты справишься со всеми сложностями! 🙌',
    'Ты можешь преодолеть любые препятствия! 💪',

    'Давай, ты можешь лучше! 💪',
    'Еще немного усилий, и все получится! 🌟',
    'Ты справишься, не сдаставайся! 👊',
    'Не останавливайся на достигнутом, иди дальше! 🏃‍',
    'Верь в себя и свои силы! 🌞',
    'Не бойся ошибок, они помогают учиться! 🤓',
    'Каждая попытка приближает тебя к цели! 🎯',
    'Твой труд не пропадет даром! 🌻',
    'Будь настойчивым и не сбавляй темпа! 🏋️‍',
    'Перестань сомневаться и действуй! 💥'

]

dict_pzOptions = {
    1: ['Да', 'Нет'],
    2: ['цель', 'задачи', 'требования', 'технологии и платформа', 'описание разделов'],
    3: ['обзор предметной области?', 'содержит ли он ссылки на авторов?'],
    4: ['Включает ли он необходимое количество аналогов?', 'Присутствуют ли у вас недостатки аналогов?'],
    5: ['У вас присутствует схема?', 'Есть ли у вас описание элементов?'],
    6: ['Содержатся требования к составу выполняемых функций?',
        'Имеются требования к входным и выходным данным?(данные должны быть корректны,не менее 5-10 записей)',
        'Содержатся требования к пользовательскому интерфейсу?',
        'Включаеются ли требования к информационной и программной совместимости?', 'Прописаны этапы разработки?'],
    7: ['У вас присутствует схема?', 'Есть ли у вас описание элементов?'],
    8: ['У вас присутствует схема?', 'Есть ли у вас описание элементов?'],
    9: ['У вас присутствует схема?', 'Есть ли у вас описание элементов?'],
    10: ['События обработаны?', 'Указаны спецификации обработчиков?'],
    11: ['Алгоритм разработан?', 'Содержатся спецификации функций или функциональных элементов?'],
    12: ['Интерфейс разработан?', 'Присутствуют спецификации процедур или операций чтения-записи?'],
    13: ['Указаны примеры проверки в нормальных условиях?', 'Показаны примеры проверки в экстремальных условиях?',
         'Указаны примеры проверки в исключительных условиях?'],
    14: ['Указаны характеристики?',
         'Написано, какие входные и выходные данные?(данные должны быть корректны,не менее 5-10 записей)',
         'Содержится настройка программы?'],
    15: ['Рукводство функционально?', 'Написано сообщения оператору?'],
    16: ['Соотвествует ли результат работы поставленным целям?',
         'В результате работы были выполнены поставленные задачи?',
         'Были ли соблюдены требования при выполнении работы?',
         'Результат содержит технологии и платформу?', 'Вы указали описание разделов в результате проделанной работы?',
         'Вы уточнили внедрение и/или ожидаемый эффект?'],
    17: ['Количество источников соотвествует требованиям?', 'Есть ли соответствие ГОСТу?'],

}


registr = {
    'role': None,
    'lastname': None,
    'firstname': None,
    'patronymic': None
}


chh = 0

Options_answ = []

