list_support = [
    'Так держать! 👍',
    'Ты молодец! 👏',
    'У тебя все получится, я верю в тебя! 💪',
    'Продолжай в том же духе! 💯',
    'Ты делаешь все правильно, не сомневайся! 🌟',
    'Ты на верном пути к успеху! 💫',
    'Ты очень талантливый/талантливая! 🤩',
    'Твой труд принесет свои плоды! 🍎',
    'Ты справишься со всеми сложностями! 🙌',
    'Ты можешь преодолеть любые препятствия! 💪'
]

'Давай, ты можешь лучше! 💪',
'Еще немного усилий, и все получится! 🌟',
'Ты справишься, не сдаставайся! 👊',
'Не останавливайся на достигнутом, иди дальше! 🏃‍♂', ️
'Верь в себя и свои силы! 🌞',
'Не бойся ошибок, они помогают учиться! 🤓',
'Каждая попытка приближает тебя к цели! 🎯',
'Твой труд не пропадет даром! 🌻',
'Будь настойчивым и не сбавляй темпа! 🏋️‍♀', ️
'Перестань сомневаться и действуй! 💥'
